asciiart-load-test.yml
config:
  target: http://localhost:3002
  phases:
    - duration: 20
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 20
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 15
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  processor: './my-functions.js'
  plugins:
    ensure:
      thresholds:
        - http.response_time.p99: 100
        - http.response_time.p95: 75
    apdex:
      threshold: 100
    metrics-by-endpoint: { }


scenarios:
  - flow:
      - loop:
          - function: "generateRandomUser"
          - post:
              url: '/users'
              json:
                name: "{{ name }}"
                email: "{{ email }}"
    count: 50